Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driving_offences/drink_driving_offences_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: The main legislation dealing with road safety is the Road Traffic Act 1961
ga: Is í an phríomhreachtaíocht a dhéileálann le sábháilteacht ar bhóithre ná an tAcht um Thrácht ar Bhóithre, 1961

source: This law has been updated and modernised regularly over the years and following the introduction of the Road Traffic Act 2006 the Gardai have wide powers to reduce and eliminate the offence of drink driving
ga: Nuashonraíodh agus nuachóiríodh an dlí seo go rialta i gcaitheamh na mblianta, agus i ndiaidh gur tugadh isteach an tAcht um Thrácht ar Bhóithre, 2006, tá cumhachtaí fairsinge ag na Gardaí chun cion na tiomána ar meisce a laghdú agus a dhíbirt

source: The introduction of the 2006 Road Traffic Act gave the Gardai the power to breathalyse any driver stopped at a mandatory alcohol checkpoint without the need to form any opinion in relation to the driver of the vehicle
ga: Thug tabhairt isteach an Achta um Thrácht ar Bhóithre, 2006 an chumhacht do na Gardaí chun tabhairt ar dhuine a stoptar ag seicphointe éigeantach alcóil gan aon ghá tuairim a chruthú maidir le tiománaí na feithicle, séideadh isteach in anáileadán

source: The ability to breathalyse any driver is commonly known as random breath testing
ga: Tugtar tástáil randamach anála go rialta ar an gcumas chun tabhairt ar aon tiománaí séideadh isteach in anáileadán

source: Under the Road Traffic Act 2011, since June 2011, Gardaí must conduct a preliminary breath test where they believe a driver has consumed alcohol or at the scene of a crash where someone has been injured and requires medical attention
ga: Faoin Acht um Thrácht ar Bhóithre, 2011, ó Mheitheamh 2011, ní mór do Ghardaí tabhairt faoi réamhthástáil anála sa chás go gcreideann siad gur ól tiománaí alcól nó ag láthair thimpiste nuair a gortaíodh duine agus teastaíonn aird leighis uathu

source: Under the Road Traffic Act 2014, since 26 November 2014, it is possible to take a specimen of blood from a driver who is incapacitated following a serious road traffic collision and to test that specimen for intoxicants.The driver is asked, on regaining capacity, whether they consent to the issuing of a certificate of the test result on the specimen
ga: Faoin Acht um Thrácht ar Bhóithre, 2014, ón 26 Samhain 2014, is féidir eiseamal fola a ghlacadh ó thiománaí atá faoi éagumas tar éis imbhualadh tromchúiseach um thrácht ar bhóithre agus an t-eiseamal sin a thástáil i leith tocsaineach. Iarrtar ar an tiománaí, ar fhilleadh dá c(h)umas, cibé acu an dtoilíonn nó nach dtoilíonn siad go n-eiseofar deimhniú thoradh na tástála a rinneadh ar an eiseamal

source: Refusal is an offence
ga: Is ionann agus cion diúltú

source: Section 49 of the Road Traffic Act 1961 as inserted by Section 10 of the Road Traffic Act 1994 created four separate drink driving offences
ga: Cruthaíodh ceithre chion ar leithligh um thiomáint ar meisce le hAlt 49 d’Acht um Thrácht ar Bhóithre 1961 arna chur isteach le hAlt 10 den Acht um Thrácht ar Bhóithre 1994

source: From 28 October 2011, these traffic offences are replaced
ga: Ó 28 Deireadh Fómhair 2011, na cionta tráchta ina n-ionad

source: The new offences, introduced by Section 4 of the Road Traffic Act 2010, reduce the drink driving alcohol limits for all drivers
ga: Na cionta nua, a tugadh isteach ag Alt 4 den Acht um Thrácht ar Bhóithre 2010, a leagtar teorainneacha níos ísle alcóil le haghaidh gach tiománaí

source: They also differentiate between experienced drivers and new drivers – those with learner permits or who hold a driving licence for 2 years or less, or have no valid licence/permit
ga: Siad idirdhealú a dhéanamh freisin idir tiománaithe taithí agus tiománaithe nua - iad siúd le ceadanna foghlaimeora nó ag a mbeidh ceadúnas tiomána ar feadh 2 bhliain nó níos lú, nó nach bhfuil aon ceadúnas bailí/cead

source: Lower alcohol limits apply to new drivers than those that apply to experienced drivers. The lower alcohol limits applying to new drivers also apply to drivers of buses, lorries, trailers, work vehicles, taxis and other public service vehicle drivers
ga: Feidhm ag teorainneacha alcól íochtair i gcoinne an tiománaithe nua ná iad siúd a bhaineann le tiománaithe taithí acu.Na teorainneacha alcól srianta a bhaineann le tiománaithe nua maidir le tiománaithe busanna, leoraithe, leantóirí, feithiclí oibre, tacsaithe agus tiománaithe feithiclí seirbhíse poiblí chomh maith

source: The new offences are as follows:
ga: Is iad na cionta nua mar a leanas:

source: • An offence of driving or attempting to drive a mechanically propelled vehicle in a public place while under the influence of an intoxicant to such an extent as to be incapable of having proper control of the vehicle
ga: • Cion maidir le feithicil inneallghluaiste a thiomáint, nó iarracht ar fheithicil inneallghluaiste a thiomáint, in áit phoiblí agus é/í an oiread sin faoi bhrí meiscigh nach féidir leis/léi an fheithicil a smachtú i gceart

source: • An offence of driving or attempting to drive a mechanically propelled vehicle in a public place while there is present in your body a quantity of alcohol such that, within 3 hours after so driving or attempting to drive, the concentration of alcohol in your blood exceeds a concentration of:
ga: • Cion maidir le feithicil inneallghluaiste a thiomáint, nó iarracht ar fheithicil inneallghluaiste a thiomáint, in áit phoiblí fad a bheidh ina c(h)olainn an oiread sin alcóil gur mó, laistigh de 3 huaire an chloig tar éis dó/di tiomáint, nó iarracht a thabhairt ar thiomáint, amhlaidh, an cion alcóil ina c(h)uid fola ná cion

source: - 50 milligrammes of alcohol per 100 millilitres of blood for experience drivers
ga: - 50 milleagram alcóil in aghaidh an 100 millilítear fola le haghaidh tiománaí taithí

source: - 20 milligrammes of alcohol per 100 millilitres of blood for other drivers
ga: - 20 milleagram alcóil in aghaidh an 100 millilítear fola do thiománaithe eile

source: • An offence of driving or attempting to drive a mechanically propelled vehicle in a public place while there is present in your body a quantity of alcohol such that, within 3 hours after so driving or attempting to drive, the concentration of alcohol in your urine exceeds a concentration of:
ga: • Cion maidir le feithicil inneallghluaiste a thiomáint, nó iarracht ar fheithicil inneallghluaiste a thiomáint, in áit phoiblí fad a bheidh ina c(h)olainn an oiread sin alcóil gur mó, laistigh de 3 huaire an chloig tar éis dó/di tiomáint, nó iarracht a thabhairt ar thiomáint, amhlaidh, an cion alcóil ina c(h)uid fuail ná cion

source: - 67 milligrammes of alcohol per 100 millilitres of urine for experienced drivers
ga: - 67 milleagram alcóil in aghaidh an 100 millilítear fuail le haghaidh tiománaí taithí

source: - 27 milligrammes of alcohol per 100 millilitres of urine for other drivers
ga: - 27 milleagram alcóil in aghaidh an 100 millilítear fuail do thiománaithe eile

source: • An offence of driving or attempting to drive a mechanically propelled vehicle in a public place while there is present in your body a quantity of alcohol such that, within 3 hours after so driving or attempting to drive, the concentration of alcohol in your breath exceeds a concentration of:
ga: • Cion maidir le feithicil inneallghluaiste a thiomáint, nó iarracht ar fheithicil inneallghluaiste a thiomáint, in áit phoiblí fad a bheidh ina c(h)olainn an oiread sin alcóil gur mó, laistigh de 3 huaire an chloig tar éis dó/di tiomáint, nó iarracht a thabhairt ar thiomáint, amhlaidh, an cion alcóil ina c(h)uid anála ná cion

source: - 22 microgrammes of alcohol per 100 millilitres of breath for an experience driver
ga: - 22 micreagram alcóil in aghaidh an 100 millilítear anála le haghaidh tiománaí taithí

source: - 9 microgrammes of alcohol per 100 millilitres of breath for other drivers
ga: - 9 micreagram alcóil in aghaidh an 100 millilítear anála do thiománaithe eile

source: What is mandatory alcohol testing and how does it work?
ga: Cad is tástáil éigeantach alcóil ann agus conas a oibríonn sé?

source: Mandatory alcohol testing means random breath testing
ga: Is éard a chiallaíonn tástáil alcóil ná tástáil randamach anála

source: The Road Traffic Act 2006 allows the Gardai (in certain circumstances) to breathalyse the drivers of vehicles without the need to have formed the opinion that the driver had consumed alcohol
ga: Ceadaítear le hAcht um Thrácht ar Bhóithre 2006 do na Gardaí (i gcúinsí áirithe) anáil tiománaithe feithiclí a anailísiú gan gá dóibh a bheith den tuairim gur ól an tiománaí alcól

source: The power can however only be exercised at checkpoints which have been authorised by a Garda Inspector
ga: Ní féidir feidhm a bhaint as an gcumhacht áfach ach amháin ag seicphointí atá údaraithe ag Cigire den Gharda Síochána

source: These checkpoints are specifically designed for the purpose of mandatory alcohol testing
ga: Bíonn na seicphointí seo deartha go sonrach don tástáil éigeantach alcóil

source: The authorisation must be given by the Inspector in writing and allows Gardai to set up a checkpoint in a public place (or another place)
ga: Caithfidh an Cigire an t-údarú a thabhairt i scríbhinn agus ceadaíonn sé do Ghardaí seicphointe a bhunú in áit phoiblí (nó in áit eile)

source: The Gardai can stop any mechanically propelled vehicle (including motorcycles, scooters, electric bicycles, wheelchairs, etc.) and may require the driver of the vehicle to do the following;
ga: Is féidir leis na Gardaí aon fheithicil inneallghluaiste a stopadh (lena n-áirítear gluaisrothair, scútair, rothair leictreacha, cathaoireacha rotha, srl.) agus féadfaidh siad iarraidh ar thiománaí na feithicle an méid seo a leanas a dhéanamh:

source: • Provide a specimen of their breath by exhaling into equipment used for indicating the presence of alcohol in the breath, or
ga: • Eiseamal dá (h)anáil a sholáthar trí easanálú isteach i dtrealamh a úsáidtear chun a thabhairt le fios cibé an bhfuil alcól san anáil, nó

source: • Accompany the Garda (or another Garda) to a place (including a vehicle) at or near the checkpoint to provide by a breath specimen, or
ga: • Dul in éineacht leis an nGarda (nó le Garda eile) chuig áit (feithicil san áireamh) ag an seicphointe nó gar dó chun eiseamal anála a sholáthar, nó

source: • To leave the vehicle at the place where it has been stopped
ga: • An fheithicil a fhágáil ag an áit mar a stopadh í

source: Anyone who refuses or fails to comply immediately with the above or to comply in the manner required by the Gardai is guilty of an offence
ga: Tá aon duine, a dhiúltaíonn nó a dteipeann air/uirthi an méid thuasluaite a chomhlíonadh láithreach nó a chomhlíonadh ar an mbealach a éilíonn na Gardaí, ciontach as cion

source: A Member of the Gardai may also require the driver of the vehicle to move it to a place in the area of the checkpoint and to keep or leave it there until the person has complied with a requirement made of him or her
ga: Féadfaidh Ball de na Gardaí an méid seo a leanas a éileamh ar thiománaí na feithicle freisin an fheithicil a bhogadh chuig áit i limistéar an tseicphointe agus í a choinneáil nó a fhágáil ansin go dtí go mbeidh éileamh arna dhéanamh air nó uirthi comhlíonta ag an duine

source: The Gardai may arrest (without warrant) anyone who in the opinion of the Garda, is committing or has committed an offence of failure or refusal to comply with a request by the Garda
ga: Féadfaidh na Gardaí aon duine a ghabháil (gan bharántas) a bhfuil cion á dhéanamh nó ciondéanta aige nó aici, dar leis na Gardaí, sa mhéid is gur theip air nó uirthi rud a d’iarr an Garda air nó uirthi a dhéanamh nó gur dhiúltaigh sé nó sí é a chomhlíonadh

source: Can a Garda stop me randomly while in traffic and breathalyse me?
ga: An féidir le Garda mé a stopadh go randamach agus mé sa trácht agus m’anáil a anailísiú?

source: The Road Traffic Act 2006 does not give the Gardai the power to pull cars over while in traffic and breathalyse the driver randomly
ga: Ní thugtar de chumhacht do na Gardaí le hAcht um Thrácht ar Bhóithre 2006 carranna a tharraingt suas agus iad i dtrácht agus anáil an tiománaí a anailísiú go randamach

source: It only gives the Gardai the power to conduct checkpoints for the purpose of random breath testing
ga: Ní thugann sé ach an chumhacht do na Gardaí le seicphointí a reáchtáil chun críocha na tástála randamaí anála

source: If however, the Garda has formed the opinion that you have committed any road traffic offence, or that you have been involved in a road traffic accident, or is of the opinion that you have consumed alcohol then they can stop you in traffic and breathalyse you under the powers given by the Road Traffic Act 2002
ga: Má tá an Garda den tuairim áfach go bhfuil aon chion um thrácht ar bhóithre déanta agat, nó go raibh tú páirteach i dtionóisc tráchta ar an mbóthar, nó go bhfuil alcól ólta agat dar leis, is féidir leis tú a stopadh i dtrácht agus d’anáil a anailísiú faoi na cumhachtaí a thugtar leis an Acht um Thrácht ar Bhóithre 2002

source: Can the Gardai set up a mandatory alcohol testing checkpoint anywhere?
ga: An féidir leis na Gardaí seicphointe tástála alcóil éigeantach a chur ar bun in áit ar bith?

source: Provided it is in a public place and is authorised by a Garda Inspector
ga: Ar an gcoinníoll go bhfuil sé in áit phoiblí agus údaraithe ag Cigire den Gharda Síochána

source: The reason the Gardai have been given powers to set up these checkpoints is to reduce accidents caused by drink driving in locations where they will have most effect
ga: Is í an chúis go bhfuil cumhachtaí tugtha do na Gardaí chun na seicphointí seo a chur ar bun ná chun tionóiscí de bharr na tiomána ar meisce a laghdú in áiteanna mar is mó éifeacht a bheidh ag na seicphointí

source: So, basically they can conduct checkpoints on main roads, outside pubs or night clubs or anywhere else they feel will reduce the number of drink drivers on the road
ga: Go bunúsach mar sin, is féidir leo seicphointí a reáchtáil ar phríomhbhóithre, lasmuigh de phubanna nó de chlubanna oíche nó in aon áit eile go laghdófar líon na dtiománaithe ólta ar an mbóthar dar leo

source: The Gardai are however obliged to exercise these powers in a proportional manner
ga: Tá sé d’oibleagáid ar na Gardaí na cumhachtaí seo a fheidhmiú ar bhealach comhréireach áfach

source: What proof is needed in drink driving cases?
ga: Cén cruthúnas a bhíonn riachtanach i gcásanna na tiomána ar meisce?

source: When a Garda decides to prosecute someone for drink driving they must provide the court with certain proofs in order to obtain a conviction
ga: Nuair a chinneann Garda duine a ionchúiseamh i dtiomáint ar meisce caithfidh siad cruthúnais áirithe a sholáthar don chúirt chun ciontú a fháil

source: The proofs required under Section 4(2), (3) and (4) of the Road Traffic Act 2010 (i.e
ga: Tá na cruthúnais a éilítear faoi Alt 4(2), (3) agus (4) den Acht um Thrácht ar Bhóithre 2010 (.i

source: blood, urine and breath test) are slightly different to that of Section 4(1) (driving while under the influence of an intoxicant)
ga: tástáil fola, fuail agus anála) beagán difriúil de na cinn in Alt 4(1) (tiomáint faoi bhrí meiscigh)

source: This charge is normally preferred where an arrested person has failed to provide a blood, urine or breath specimen with the result that it is not possible to bring a case under either Section 4(2), (3) or (4)
ga: Is fearr leis na cúirteanna an cúiseamh seo nuair a theip ar dhuine atá gafa eiseamal fola, fuail nó anála a sholáthar rud a fhágann nach féidir cás a thabhairt faoi Alt 4(2) (3) nó (4)

source: For an offence under 4(1) the following elements or proofs must be given to the court;
ga: I gcás ciona faoi 4(1) caithfear na heilimintí nó na cruthúnais seo a leanas a thabhairt don chúirt:

source: • That you drove or attempted to drive
ga: • Gur thiomáin tú nó go ndearna tú iarracht ar thiomáint

source: • That you must have driven or attempted to drive a mechanically propelled vehicle
ga: • Go gcaithfidh gur thiomáin nó go ndearna tú iarracht ar fheithicil inneallghluaiste a thiomáint

source: • That your driving or attempt to drive took place in a public place
ga: • Gur tharla an tiomáint a rinne tú nó an iarracht ar thiomáint in áit phoiblí

source: • That you were under the influence of an intoxicant to such a degree that you could not properly control the vehicle
ga: • Go raibh tú an oiread sin faoi bhrí meiscigh nárbh fhéidir leat an fheithicil a smachtú i gceart

source: Normally the Garda will give evidence of their observations and the opinion they formed as a result
ga: De ghnáth, tabharfaidh an Garda fianaise faoin méid a chonaic sé agus faoin tuairim ar ar tháinig sé dá thoradh

source: Other Gardai or doctors who dealt with the person while in the Garda Station can also give evidence in support of this
ga: Is féidir le Gardaí nó dochtúirí eile a phléigh leis an duine le linn dó a bheith i Stáisiún an Gharda Síochána fianaise a thabhairt chun tacú leis seo freisin

source: Other evidence that the Garda may give could include the defendants’ inability to perform simple co-ordination tests when asked
ga: D’fheadfadh éagumas an chosantóra tástálacha simplí comhordaithe a dhéanamh a bheith san áireamh i bhfianaise eile a fhéadfaidh an Garda a thabhairt

source: For example, you were unable to walk a straight line or unable to put the key into the door lock
ga: Mar shampla, ní raibh tú in ann líne dhíreach a shiúl nó in ann an eochair a chur isteach i nglas an dorais

source: Such evidence will support the view that you were incapable of having proper control of their vehicle
ga: Tacóidh fianaise den sórt sin leis an dearcadh nach raibh sé ar do chumas an fheithicil a smachtú i gceart

source: Offences under Section 4(2), 4(3) and 4(4)
ga: Cionta faoi Alt 4(2), 4(3) agus 4(4)

source: The most common type of prosecution for drink driving is under these three sections for driving when over the prescribed limits for blood/alcohol, urine/alcohol or breath/alcohol
ga: Is é an t-ionchúiseamh is coitianta maidir le tiomáint ar meisce faoi na trí alt seo do dhuine a thiomáineann agus é os cionn na dteorainneacha forordaithe le haghaidh fola/alcóil, fuail/alcóil nó anála/alcóil

source: Proof of the concentration of alcohol in the case of section 4(2) and 4(3) will be provided by a certificate of analysis from Medical Bureau of Road Safety
ga: Soláthrófar cruthúnas faoi thiúchan an alcóil i gcás alt 4(2) agus 4(3) le deimhniú anailíse ón Lia-Bhiúró um Shábháilteacht ar Bhóithre

source: In the case of a prosecution under section 4(4) the concentration is proven by a statement printed from an intoxilyzer, a machine designed to measure the concentration of alcohol in the breath
ga: I gcás ionchúisimh faoi alt 4(4) cruthaítear an cion alcóil le ráiteas arna phriontáil ag anáileadán Intoxilyzer, inneall a dearadh chun cion an alcóil san anáil a thomhas

source: What is the procedure if I am arrested for drink driving?
ga: Cad é an nós imeachta má dhéantar mé a ghabháil as a bheith ag tiomáint ar meisce?

source: If you are arrested at the roadside for drink driving, the Garda is obliged to inform you in ordinary understandable language that you are being arrested for the offence of drink driving
ga: Má ghabhtar tú ar thaobh an bhóthair as a bheith ag tiomáint ar meisce, tá sé d’oibleagáid ar an nGarda a chur in iúl duit i ngnáthfhriotal sothuigthe go bhfuiltear do do ghabháil i gcion na tiomána ar meisce

source: You will be brought to a local Garda Station where you will be informed of your rights by a member in charge of the station
ga: Tabharfar chuig Stáisiún áitiúil an Gharda Síochána tú mar a gcuirfidh ball a bheidh i gceannas ar an stáisiún do chearta in iúl duit

source: These rights include consulting with a solicitor but should be noted that failure to contact your solicitor will not excuse you from complying with the Garda’s request for a sample of blood, urine or breath specimen
ga: Tá comhairliúchán le d’aturnae san áireamh leis na cearta seo ach ba chóir a thabhairt do d’aire nach ligfear saor tú ón dualgas le hiarratas an Gharda ar shampla fola; nó ar eiseamal fuail nó anála a chomhlíonadh má theipeann ort teagmháil a dhéanamh le d’aturnae

source: In the case of Walsh v O’Buchalla 1 I.R.56 the right of access to a solicitor was evoked by the defendant who claimed that because he was denied access to his solicitor, the sample of blood taken was unlawful because his constitutional right to access to a solicitor was denied
ga: I gcás Walsh v Ó Buachalla 1 I.R. 56 d’agair an cosantóir an ceart le teacht ar aturnae agus é á éileamh toisc gur diúltaíodh dó teacht ar a aturnae, go raibh an sampla fola a tógadh neamhdhleathach toisc gur diúltaíodh dá cheart bunreachtúil le teacht ar aturnae

source: The High Court rejected this and said that because it was a statutory obligation to provide a specimen when arrested for drink driving, no amount of legal advice would change this obligation
ga: Dhiúltaigh an Ard-Chúirt é seo agus dúirt go raibh sé ina oibleagáid reachtúil eiseamal a sholáthar nuair a ghabhtar duine i dtiomáint ar meisce agus nach n-athródh aon chomhairle dlí an oibleagáid seo

source: In other words, the solicitor could not have advised their client not to provide a specimen which would amount to advising them to break the law
ga: I bhfocail eile, ní fhéadfadh an t-aturnae comhairliú dá chliant gan eiseamal a sholáthar rud arbh ionann é agus comhairliú dóibh an dlí a bhriseadh

source: If you provide a sample of blood or urine the sample will be divided into two containers in your presence and sealed
ga: Má sholáthraíonn tú sampla fola nó fuail roinnfear an sampla in dhá choimeádán agus tú i láthair agus cuirfear faoi shéala iad

source: You will then be offered a sample of your choice and the remaining sample will be sent to the Medical Bureau of Road Safety for analysis
ga: Déanfar do rogha sampla a thairiscint duit ansin agus seolfar an sampla a bheidh fágtha chuig an Lia-Bhiúró um Shábháilteacht ar Bhóithre lena anailísiú

source: The results of the test will be posted to both yourself and to the Garda concerned
ga: Seolfar torthaí na tástála chugat féin agus chuig an nGarda a bhí i gceist

source: You may have your own sample independently analysed if you wish
ga: Féadfaidh tú anailísiú neamhspleách a fháil ar do shampla féin más mian leat

source: Similarly, if you provide a sample of your breath the intoxilyser machine will give two immediate print outs of the level of alcohol in your breath
ga: Ar an gcaoi chéanna, má sholáthraíonn tú sampla de d’anáil priontálfaidh an t-inneall intoxilyser dhá bhileog láithreach maidir le leibhéal an alcóil i d’anáil

source: You will be offered a choice of either read-out to retain for yourself and the other can be used by the Garda in court as proof that you were above the legal limit
ga: Déanfar do rogha bileog phriontáilte a thairiscint duit chun coinneáil duit féin agus Is féidir leis an Garda úsáid an ceann eile sa Chúirt mar chruthúnas go raibh tú os cionn na teorann dleathaí

source: If the alcohol level is shown to be over the legal amount then the Garda will either issue a fixed penalty notice or summons you to appear in the District Court to answer the charge of drink driving
ga: Má thaispeántar go bhfuil leibhéal an alcóil os cionn na méide dleathaí bheidh tú ag eisiúint le fógra pionóis sheasta nó cuirfidh an Garda toghairm chugat ansin le bheith i láthair sa Chúirt Dúiche le cúiseamh na tiomána ar meisce a fhreagairt

source: Of course, if you are below the legal limit then that is the end of the matter
ga: Ar ndóigh, má bhíonn tú faoi bhun na teorann dleathaí sin deireadh an scéil
